vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/ADCC_TYPE_A_registers.h
/* Common ADCC_TYPE_A — generated by stm32_reggen.py.
 * Do not edit this file manually!
 * Superset across: stm32f030, stm32g070, stm32h503
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "ADCC_TYPE_A_index.h"

typedef union {
	struct {
		uint32_t DUAL          : 5; // /*!< ADC multimode mode selection */
		uint32_t _reserved5    : 3;
		uint32_t DELAY         : 4; // /*!< ADC multimode delay between 2 sampling phases */
		uint32_t _reserved12   : 1;
		uint32_t DMACFG        : 1; // /*!< ADC multimode DMA transfer configuration */
		uint32_t MDMA          : 2; // /*!< ADC multimode DMA transfer enable */
		uint32_t CKMODE        : 2; // /*!< ADC common clock source and prescaler (prescaler only for clock source synchronous) */
		uint32_t PRESC         : 4; // /*!< ADC common clock prescaler, only for clock source asynchronous */
		uint32_t VREFEN        : 1; // /*!< ADC internal path to VrefInt enable */
		uint32_t TSEN          : 1; // /*!< ADC internal path to temperature sensor enable */
		uint32_t VBATEN        : 1; // /*!< ADC internal path to battery voltage enable */
		uint32_t _reserved25   : 7;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_adcc_type_a,ccr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_adcc_type_a,ccr),bits);

typedef union {
	struct {
		REGDEF_NAME(com_adcc_type_a,ccr) CCR;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(stm32com,adcc_type_a);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(stm32com,adcc_type_a)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,adcc_type_a), CCR) != 0, "Offset mismatch for CCR");
